
## Environment: development ✅
#### Terraform Format and Style ✅
<details><summary>Show improper formatted and/or styled files</summary>

```


```

</details>

#### Terraform Initialization ✅
<details><summary>Show initialization details</summary>

```


[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mUpgrading modules...[0m
Downloading git::ssh://git@github.com/matthias-kuklinski/cloud-aws-ops for iam...
- iam in .terraform/modules/iam/iac/modules/iam

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.31.0"...
- Finding latest version of hashicorp/random...
- Installing hashicorp/aws v5.31.0...
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)
- Installing hashicorp/random v3.6.1...
- Installed hashicorp/random v3.6.1 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

</details>

#### Terraform Validation ✅
<details><summary>Show validation details</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan ✅
<details><summary>Show plan</summary> 

```

aws_dynamodb_table.terraform: Refreshing state... [id=cloud-aws-ops-development]
aws_s3_bucket.terraform: Refreshing state... [id=cloud-aws-ops-development]
aws_s3_bucket_public_access_block.terraform: Refreshing state... [id=cloud-aws-ops-development]
aws_s3_bucket_versioning.terraform: Refreshing state... [id=cloud-aws-ops-development]
aws_s3_bucket_server_side_encryption_configuration.terraform: Refreshing state... [id=cloud-aws-ops-development]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.aws_iam_user.this will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = (known after apply)
      + path          = "/"
      + tags_all      = {
          + "context"     = "cloud-aws-ops-development"
          + "environment" = "development"
        }
      + unique_id     = (known after apply)
    }

  # module.iam.random_string.id will be created
  + resource "random_string" "id" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: development_2

To perform exactly these actions, run the following command to apply:
    terraform apply "development_2"

```

</details>

#### Context
Actor: @matthias-kuklinski
Trigger: `pull_request`
GitHub Action Reference: [8878113712](https://github.com/matthias-kuklinski/cloud-aws-ops/actions/runs/8878113712)
Terraform Plan URI: development_2development_2
